# Brews.
brew 'cloudflared'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'ffmpeg'
brew 'fnm'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'himalaya'
brew 'jq'
brew 'lazygit'
brew 'llama.cpp'
brew 'mole'
brew 'ollama'
brew 'openssl'
brew 'oven-sh/bun/bun'
brew 'postgresql@17'
brew 'pnpm'
brew 'readline'
brew 'rbenv'
brew 'starship'
brew 'sqlite3'
brew 'tmux'
brew 'uv'
brew 'vercel-cli'
brew 'wget'
brew 'xmlstarlet'
brew 'xz'
brew 'yt-dlp'
brew 'zlib'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

brew 'bendews/tap/apw'
brew 'steipete/tap/imsg'
brew 'steipete/tap/remindctl'

# Casks
cask '1password'
cask 'chatgpt'
cask 'claude'
cask 'claude-code@latest'
cask 'codex'
cask 'codex-app'
cask 'ghostty'
cask 'github'
cask 'grok-build'
cask 'helium-browser'
cask 'linear-linear'
cask 'ngrok'
cask 'notion'
cask 'notion-cli'
cask 'obsidian'
cask 'ollama-app'
cask 'orbstack'
cask 'sf-symbols'
cask 'slack'
cask 'telegram'
cask 'xdevplatform/tap/xurl'
cask 'zed'

# Python.
uv 'browser-harness'

# Fonts.
cask 'font-geist'
cask 'font-geist-mono'
cask 'font-ibm-plex-mono'
cask 'font-ibm-plex-sans'
cask 'font-lilex'
cask 'font-maple-mono'
cask 'font-maple-mono-nf'
cask 'font-new-york'
cask 'font-sf-mono'
cask 'font-sf-pro'
