# Brews.
brew 'claude-code'
brew 'codex'
brew 'cloudflared'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'ffmpeg'
brew 'fnm'
brew 'jq'
brew 'lazygit'
brew 'ollama'
brew 'openssl'
brew 'postgresql@17'
brew 'readline'
brew 'rbenv'
brew 'starship'
brew 'sqlite3'
brew 'tmux'
brew 'wget'
brew 'xmlstarlet'
brew 'xz'
brew 'yt-dlp'
brew 'zlib'
brew 'zsh'
brew 'zsh-completions'

# Casks
cask 'claude'
cask 'codex'
cask 'github'
cask 'ghostty'
cask 'linear'
cask 'sf-symbols'
cask 'code'

# Fonts.
cask 'font-geist'
cask 'font-geist-mono'
cask 'font-maple-mono-nf'
cask 'font-new-york'
cask 'font-sf-pro'
cask 'font-sf-mono'
